app/controllers/blogs_controller.rb

INSERT INTO "blogs" ("title", "body", "category", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "いいいい"], ["body", "<p>っっっっっっs</p>\r\n"], ["category", "a"], ["user_id", 1], ["created_at", "2018-04-10 06:41:59.893375"], ["updated_at", "2018-04-10 06:41:59.893375"]]
---
  def create
      #ストロングパラメータを使う
	 blog = Blog.new(blog_params)
     blog.user_id = 1
     blog.category = 'a'
     if blog.save

SELECT  "blogs".* FROM "blogs" ORDER BY "blogs"."id" ASC LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "blogs"
---
  def index
  	 # @blogs = Blog.all
     @blogs = Blog.page(params[:page])

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "blogs" SET "title" = ?, "body" = ?, "image_id" = ?, "updated_at" = ? WHERE "blogs"."id" = ?  [["title", "uuuuu"], ["body", "<p>uuuuuu</p>\r\n"], ["image_id", nil], ["updated_at", "2018-04-15 07:00:37.439090"], ["id", 1]]
---
  def update
      blog = Blog.find(params[:id])
      blog.update(blog_params)